afraid
vylakany
after
po
afternoon
poobedie
again
znova
all
vsetko
always
vzdy
and
a
animal
zviera
another
dalsi
any
akykolvek
are
su
around
okolo
away
prec
baby
dieta
back
spat
bad
zly
bag
taska
be
byt
beautiful
prekrasna
because
pretoze
before
predtym
behind
za
believe
verit
best
najlepsi
better
lepsi
big
velky
bird
vtak
birthday
narodeniny
bit
trocha
blue
modry
boat
cln
book
kniha
both
oboje
box
box
boy
chlapec
break
prestavka
bring
priniest
broken
zlomeny
brother
brat
brown
hneda
building
budova
bus
autobus
but
ale
buy
kupit
call
hovor
came
prisiel
can
moct
car
auto
card
karta
carry
niest
chair
stolicka
change
zmenit
Christmas
Vianoce
clean
cisty
close
zavriet
coffee
kava
cold
chladny
color
farba
come
prist
could
moct
crazy
sialeny
cry
plac
cut
strihat
dad
ocko
day
den
dead
mrtvy
did
urobil
different
rozdielny
dinner
vecera
dirty
spinavy
done
hotovy
door
dvere
down
dole
draw
kreslit
drive
soferovat
dry
suchy
eat
jest
eight
osem
enough
dost
every
kazdy
everything
vsetko
eye
oko
face
tvar
fall
spadnut
far
daleko
fast
rychlo
father
otec
feel
citit
feet
nohy
fell
spadol
find
najst
fine
fajn
finish
skoncit
fire
ohen
first
prvy
five
pat
fix
opravit
floor
poschodie
flood
povoden
foot
noha
for
pre
forget
zabudnut
found
najdeny
four
styri
free
zadarmo
friend
kamarat
from
od
fruit
ovocie
full
plny
funny
zabavny
game
hra
get
dostat
girl
dievca
give
dat
glass
sklo
glasses
okuliare
good
dobry
green
zeleny
hand
ruka
happy
stastny
hard
tazky
hat
klobuk
head
hlava
hello
ahoj
help
pomoc
here
tu
high
vysoky
hold
drzat
home
domov
hospital
nemocnica
hot
horuci
house
dom
hurt
ublizit
I
Ja
ice
lad
idea
napad
inside
vo vnutri
is
je
juice
dzus
just
len
kind
mily
know
vediet
last
posledny
later
neskor
lay
lezat
left
vlavo
light
svetlo
line
ciara
listen
pocuvat
little
malo
long
dlhy
lot
vela
lunch
obed
mom
mama
Monday
Pondelok
money
peniaze
month
mesiac
more
viac
morning
rano
mouth
usta
music
hudba
my
moj
name
meno
never
nikdy
new
novy
next
dalsi
night
noc
nine
devat
no
nie
nose
nos
nurse
sestricka
old
stary
one
jeden
only
jediny
open
otvorit
or
alebo
other
iny
paper
papier
part
cast
party
vecierok
people
ludia
phone
telefon
picture
obrazok
pink
ruzova
place
miesto
play
hrat
please
prosim
pull
tahat
push
tlacit
quiet
ticho
radio
radio
rain
dazd
read
citat
ready
pripraveny
real
skutocny
red
cervena
remember
pamatat
rest
odpocivat
run
bezat
school
skola
short
kratky
side
strana
silly
hlupy
sister
sestra
six
sest
snow
sneh
soft
makky
some
nejaky
something
nieco
soon
coskoro
sorry
prepac
stop
zastavit
street
ulica
summer
leto
sun
slnko
talk
rozpravat
tall
vysoky
tape
paska
teach
ucit
ten
desat
they
oni
thing
vec
think
mysliet
three
tri
time
cas
today
dnes
tomorrow
zajtra
why
preco
wind
vietor
work
pracovat
working
pracujuci
write
pisat
wrong
zly
yellow
zlta
yes
ano
yesterday
vcera
you
ty